import matplotlib.pyplot as plt
import math as m
import numpy as np 
# Определению активности Sr90+Y90 на момент измерений 29.03.2021
# Данные счетного образца:
# ВНИИМ имени Д.И. Менделеева 
# OMACH №153/18 Sr-90
# А=10.6 Бк, М=0.40311 на 12.04.2021

m_Sr=0.40311
T_Sr=10490.1 # период полураспада Sr-90 (дни)
A_Sr0=10.6 #Активность на момент времени 12.04.2018
t_Sr=365+366+31+28+29+(365-31-28-31-4)    #разница времени (дни)
A_Srt=A_Sr0*m.exp(-t_Sr*m.log(2,m.e)/T_Sr)


# Определение активности Am-241 на момент измерений 29.03.2021 
# Данные счетного образца:
# ВНИИМ имени Д.И. Менделеева 
# OMACH №153/12 Am-241
# A=9.8 Бк, M=0.40042 на 12.04.2018
m_Am=0.40042
T_Am=432.2*365
A_Am0=9.8
t_Am=t_Sr
A_Amt=A_Am0*m.exp(-t_Am*m.log(2,m.e)/T_Am)

	
# Определение активности смеси Am-241 + Sr-90 на момент измерений 29.03.2021 
# Данные счетного образца:
# ВНИИМ имени Д.И. Менделеева 
# OMACH №153/22 
#Am-241 A=10.1 Бк, 
#Sr-90+Y-90 A=10.3 Бк
#M=0.40541 на 12.04.2018	
m_Am_Sr=0.40541
T_Am_Sr=T_Sr+T_Am
A_Am_compendum_0=10.1
A_Sr_compendum_0=10.3
# Активность Am-241 в смеси на момент 29.03.2021
A_Am_compendum_t=A_Am_compendum_0*m.exp(-t_Am*m.log(2,m.e)/T_Am) 
# Активность Sr-90 в смеси на момент 29.03.2021
A_Sr_compendum_t=A_Sr_compendum_0*m.exp(-t_Sr*m.log(2,m.e)/T_Sr) 
Q=np.array([[A_Sr_compendum_t],[A_Am_compendum_t]])

if __name__=="__main__":

	print('Активность Sr-90 на 29.03.2021')
	print('A =',round(A_Srt,3), '[Бк]')	
	print('Активность Am-241 на 29.03.2021')
	print('A =',round(A_Amt,3), '[Бк]')
	print('Активность Am-241 и Sr-90 в смеси на 29.03.2021')
	print('A (Am-241 в смеси) =',round(A_Am_compendum_t,3), '[Бк]')
	print('A (Sr-90 в смеси) =',round(A_Sr_compendum_t,3), '[Бк]')
	
	
	


